"""Дополнительный модуль: глобальные переменные и константы."""


# глобальные переменные данных
STATS = {}
SAVES = {}

PLAYERS = []
TOKENS = ('X', 'O')

DIM = 3
RANGE = range(DIM)
RANGE_FLAT = range(DIM**2)

TURNS = [1]
# TURNS = [1, 2, 3]
BOARD = [' '] * DIM**2
# BOARD = ['X', 'X', '0', '0', 'X', 'X', '0', '0', 'X']
# BOARD = ['0', 'X', '0', '0', 'X', 'X', 'X', '0', 'X', 'X', 'X', 'X', '0', '0', '0', '0']
# BOARD = ['0', '0', '0', '0', '0', '0', 'X', '0', 'X', '0', 'X', 'X', 'X', 'X', '0', '0', '0', '0', 'X', 'X', 'X', '0', '0', '0', '0']

# глобальные константы
APP_TITLE = "КРЕСТИКИ-НОЛИКИ"
PROMPT = ' > '
